[
    "     炊紙(かしきし, kashikishi)へようこそ！\n\n　炊紙はアイデアノートアプリ、つまりメモ帳です。まずはカーソルキーやemacsキーバインドでこの文章を読み進めてみましょう。カーソルキーの上下左右に対応するキーバインドは以下の通りです。カーソルキーを動かして楽しんでみてください。\n(ここではキーバインドは🪄の絵文字で表します)\n\n🪄 Ctrl + F : 一文字進む\n🪄 Ctrl + B : 一文字戻る\n🪄 Ctrl + N : 一行進む\n🪄 Ctrl + P : 一行戻る\n\n　炊紙を終了するキーバインドは以下です。通常のGUIアプリケーション同様、ウインドウの終了ボタンでも終了できます。\n\n🪄 Ctrl + X, Ctrl + C : 炊紙の終了\n\n　文字移動で少しカッコいいキーバインドは以下です。\n\n🪄 Ctrl + A : 行頭に移動する\n🪄 Ctrl + E : 行末に移動する\n🪄 Alt  + F : 単語単位で進む\n🪄 Alt  + B : 単語単位で戻る\n🪄 Ctrl + Shift + , : 文章先頭に移動\n🪄 Ctrl + Shift + . : 文章末尾に移動\n🪄 マウスホイール   : 一行進む・戻る\n\n　キーボードの操作がおかしいなと思った時は Ctrl + G を連打するとよいでしょう。\n\n🪄 Ctrl + G : キーバインドの状態リセット\n\n　炊紙をフルスクリーンで表示すると作業に集中できますよ。\n\n🪄 F11 : フルスクリーン切り替え(トグル)\n\n　炊紙はアイデアノートアプリですので、文章を入力することもできます。そして、今書かれているこのヘルプも自由に編集することができます。このヘルプを編集した内容はどこにも保存されませんが、早速何か書いてみましょう。\n　Enter, Backspace, Delete などの動作は一般のテキストエディタと同じです。また、アンドゥのキーバインドは以下のとおりです。\n\n🪄 Ctrl + /  : アンドゥ\n\n===↓ ここに何か文章を書いてみよう！ ↓===\n\n\n==========================================\n\n　IMEを有効にすると日本語も入力できます。変換中の文字列が画面下部に表示されるのはちょっと前時代的かもしれませんね。(これは実装上の都合と私の好みの結果です)\n\n　さて、炊紙は従来のテキストエディタに比べて文字の拡大縮小が滑らかで、いつでも変更できることが特徴です。以下のキーバインドで画面を拡大、縮小してみましょう。\n　大きく/小さくなりすぎたときは `Ctrl + 数字9` で丁度良い大きさに戻すとよいでしょう。\n\n🪄 Ctrl + ホイール   : 拡大・縮小する\n🪄 Ctrl + プラス(+)  : 拡大する\n🪄 Ctrl + マイナス(-): 縮小する\n🪄 Ctrl + 数字8      : 縦幅を画面に収まるサイズにする\n🪄 Ctrl + 数字9      : 横幅を画面に収まるサイズにする\n🪄 Ctrl + 数字0      : 縦横を画面に収まるサイズにする\n\n　さて、拡大縮小をしていると隣に別のテキストが見えたことに気づかれたでしょうか？炊紙では複数のメモを並べて表示するので、お隣のメモが見えるのです。では、隣のメモに移動してみましょう。\n\n🪄 Ctrl + カーソル右 : 次のメモに移動する\n🪄 メモをクリック    : クリックされたメモに移動する\n",
    "　このメモにうまく移動できましたか？前のメモに戻りたいときには以下の操作で戻ることができます。\n\n🪄 Ctrl + カーソル左 : 前のメモに移動する\n🪄 メモをクリック    : クリックされたメモに移動する\n\n　Ctrl + カーソル左右でメモを移動する事ができます。この操作により、アイデアのメモをたくさん行き来することができるわけです。\n　また、メモの順序を入れ替える事ができます。何度か入れ替えてみるとよいでしょう。\n\n🪄 Ctrl + Shift + カーソル左右 : 隣のメモと入れ替える\n\n　アイデアを練っている時というのは文字間隔や行間隔など、アイデアとは関係のない事がとにかく気になるものです。以下のキーバインドで変更することができます。\n\n🪄 Alt + カーソル左 : 文字間隔を狭める\n🪄 Alt + カーソル右 : 文字間隔を広げる\n🪄 Alt + カーソル上 : 行間隔を狭める\n🪄 Alt + カーソル下 : 行間隔を広げる\n\n　文字間隔や行間隔を変更していると、文字サイズが気になって来るものです。以下のキーバインドで変更することができます。\n\n🪄 Alt + Shift + カーソル左 : 文字を細くする\n🪄 Alt + Shift + カーソル右 : 文字を太くする\n🪄 Alt + Shift + カーソル上 : 文字を低くする\n🪄 Alt + Shift + カーソル下 : 文字を高くする\n\n　やりすぎると文字が反転したりなんだかよくわからないことになって、アイデアどころではなくなりますのでほどほどに調整するとよいでしょう。変な気持ちになりたい時には鏡文字による文字入力なども楽しいものですのでこれは不具合ではなく仕様という事にしています。\n\n　炊紙では縦書きにも対応しています。縦書き・横書きを都度切り替えることで文章の感じ方が変わり、別のアイデアが出てくることもあるでしょう。\n\n🪄 Alt + Shift + D : 縦書き・横書きを切り替える\n\nこのページは以上です。\nCtrl + カーソル右で隣に移動しましょう。",
    "　これまでの内容で、基本的な文章の編集、画面の拡大縮小、メモの移動、表示の調整を行ってきました。\n\n　覚えるべきキーバインドが多くて大変だったのではないでしょうか。VSCode などの現代的なテキストエディタではなどコマンドパレットでアクションを選択することができますね。\n　炊紙も同様にコマンドパレットを開くことでいくつかのアクションを選択することができます。\n　コマンドパレットを開いて、色々なアクションがあることを確認してみましょう。パレットをキャンセルするのは Ctrl + G です。\n\n🪄 Ctrl + Shift + P : コマンドパレットを開く\n🪄 Ctrl + G         : コマンドパレットをキャンセル\n\n　たくさんのアクションがあったと思います。キーバインドが覚えられなくてもこのメニューからアクションを選んで色々な操作ができます。\n",
    "　最後になりますが、この炊紙というソフトウェアはまだまだ発展途上にあるソフトウェアです。"
]